app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def is_user_disabled
    decoded_jwt = decode_token(bearer_token)
    user = User.find(decoded_jwt[0]["user"]["id"])