app/controllers/query_controller.rb

    forbidden_patterns.each do |pattern|
      if validation_query.match?(pattern)
        decoded_jwt = decode_token(bearer_token)
        user = User.find(decoded_jwt[0]["user"]["id"])
        user.update(active: "disabled")
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "active" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["active", "disabled"], ["updated_at", "2019-08-14 05:24:55.688490"], ["id", 7]]