app/controllers/solutions_controller.rb

  def index
    @solutions = Solution.where(user_id: solution_params[:user_id])
---
SELECT "solutions".* FROM "solutions" WHERE "solutions"."user_id" = $1  [["user_id", 8]]

  def create
    @solution = Solution.new(solution_params)

    if @solution.save
---
INSERT INTO "solutions" ("solution", "training", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["solution", "select * from friends;"], ["training", "joinTraining1"], ["user_id", 8], ["created_at", "2019-08-12 00:10:03.281743"], ["updated_at", "2019-08-12 00:10:03.281743"]]

  def destroy
    @solution.destroy
---
DELETE FROM "solutions" WHERE "solutions"."id" = $1  [["id", 1]]

    def set_solution
      @solution = Solution.find(params[:id])
---
SELECT "solutions".* FROM "solutions" WHERE "solutions"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]