app/controllers/solutions_controller.rb

SELECT "solutions".* FROM "solutions" WHERE "solutions"."user_id" = $1 ORDER BY "solutions"."created_at" DESC  [["user_id", 8]]
---
  def user
    @solutions = Solution.where(user_id: solution_params[:user_id]).order(created_at: :desc)