app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
      user = User.find_by(username: user_params[:username])
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "tester4"], ["LIMIT", 1]]

  def login
    user = User.find_by(username: user_params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "tester4"], ["LIMIT", 1]]